# FabricationLevelParam Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricationLevelParam Property
ParameterTypeId Class See Also
---
"Reference Level"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricationLevelParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationLevelParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricationLevelParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace